#include <iostream>  // Подключаем библиотеку для ввода/вывода
 using namespace std; // Разрешаем использовать стандартные функции без std::

int main() // Главная функция, с которой начинается выполнение программы
{         
    double pi = 3.14, r;        // Объявляем переменные
        cout << "Введите радиус круга: "; // Выводим просьбу ввести радиус
            cin >> r;        // Считываем число в переменную r
    cout << "площадь круга: " << pi * r * r << endl;   // Вычиcляем и выводим результат
    return 0;        // Завершаем программу с кодом 0 (успех)
}
