#include <iostream>  // Подключаем библиотеку для ввода/вывода
 using namespace std; // Разрешаем использовать стандартные функции без std::

int main() // Главная функция, с которой начинается выполнение программы
{         
    char Symbol;        // Объявляем переменную для хранения символа
        cout << "Введите символ: "; // Выводим просьбу ввести символ
            cin >> Symbol;        // Считываем символ в переменную Symbol
    cout << "символ: " << Symbol << endl;   // Вычиcляем и выводим
        cout << "Код: " << static_cast<int>(Symbol) << endl; // преобразуем в int и выводим Код
             cout << "Код следующего символа: " << static_cast<int>(Symbol) + 1 << endl; // преобразуем в int и выводим Код
    cout << "Следующий символ: " << static_cast<char>(Symbol + 1) << endl;

    return 0;        // Завершаем программу с кодом 0 (успех)
}