#include <iostream>  // Подключаем библиотеку для ввода/вывода
 using namespace std; // Разрешаем использовать стандартные функции без std::

int main(){ // Главная функция, с которой начинается выполнение программы
    short matrix[2][2] ;// Объявляем массив
        cout << "Элементы массива: \n" ; // Выводим надпись
    for (int i=0;i < 2;i++) { // Создаём цикл с итерациями от 0 до 2, для строк
        for (int j=0;j < 2;j++) {// Создаём цикл с итерациями от 0 до 2, для столбцов
            cout << matrix[i][j] << " "; // выводим значения чисел из массива
        } cout <<  "\n"; 
    }
cout << "Главная диагональ: \n" ;// Выводим надпись
cout << matrix[0][0] << " " << matrix[1][1] ; // выводим значения главных диагоналей
    return 0;        // Завершаем программу с кодом 0 (успех)
}