#include <iostream>  // Подключаем библиотеку для ввода/вывода
 using namespace std; // Разрешаем использовать стандартные функции без std::

int main() // Главная функция, с которой начинается выполнение программы
{         
    short numbers[5] ;        // Объявляем массив
    int sum = 0 ;          // Объявляем переменую 
        cout << "Элементы массива: \n" ; // Выводим надпись
    for (int i=0;i <= 4;i++) // Создаём цикл с итерациями от 0 до 4
    {
        cout << numbers[i] << " "; // выводим значения чисел из массива
            sum += numbers[i] ; // находим их сумму
    }
        cout << "\n" <<"Сумма элементов: " << sum;// Выводим результат
    return 0;        // Завершаем программу с кодом 0 (успех)
}