#include <iostream> //Подключаем библиотеку для работы с ввод/вывод
 #include <string> //Подключаем библиотеку для работы с строками
  int main()
{
    std::string name; //Создаём переменную с именем name
        std::cout<<"Введите ваше имя: "; //Выводим надпись о прошение ввести имя
            std::cin >> name;//Считываем, что написал пользователь и присваиваем это значение для переменной name
                std::cout << "Приветствую вас, " << name;//Выводим Приветствие, вместе с тем, что ранее записал пользователь
    return 0;
}