#include <iostream>  // Подключаем библиотеку для ввода/вывода
 using namespace std; // Разрешаем использовать стандартные функции без std::

int main() // Главная функция, с которой начинается выполнение программы
{         
    int NumberOne, NumberTwo;        // Объявляем две переменные для хранения целых чисел
        cout << "Введите длину прямоугольника: "; // Выводим просьбу ввести длину прямоугольника
            cin >> NumberOne;        // Считываем первое число в переменную NumberOne
        cout << "Введите ширину прямоугольника: "; // Выводим просьбу ввести ширину прямоугольника
            cin >> NumberTwo;        // Считываем второе число в переменную NumberTwo
    // Выводим результаты вычислений:
    cout << "Периметр: " << (NumberOne + NumberTwo) * 2 << endl;      // Складываем числа, Умножаем на 2 и выводим
    cout << "Площадь: " << NumberOne * NumberTwo << endl; // Умножаем числа и выводим

    return 0;        // Завершаем программу с кодом 0 (успех)
}