#include <iostream>  // Подключаем библиотеку для ввода/вывода
 using namespace std; // Разрешаем использовать стандартные функции без std::

int main() // Главная функция, с которой начинается выполнение программы
{         
    int NumberOne, NumberTwo;        // Объявляем две переменные для хранения целых чисел
        cout << "Введите первое число: "; // Выводим просьбу ввести число
            cin >> NumberOne;        // Считываем первое число в переменную NumberOne
        cout << "Введите второе число: "; // Выводим просьбу ввести второе число
            cin >> NumberTwo;        // Считываем второе число в переменную NumberTwo
    // Выводим результаты вычислений:
    cout << "Сумма: " << NumberOne + NumberTwo << endl;      // Складываем числа и выводим
    cout << "Разность: " << NumberOne - NumberTwo << endl;   // Вычитаем числа и выводим
    cout << "Произведение: " << NumberOne * NumberTwo << endl; // Умножаем числа и выводим

    return 0;        // Завершаем программу с кодом 0 (успех)
}
