#include <iostream>  // Подключаем библиотеку для ввода/вывода
 using namespace std; // Разрешаем использовать стандартные функции без std::

int main() // Главная функция, с которой начинается выполнение программы
{         
    int year;        // Объявляем переменную
        cout << "Введите год: "; // Выводим просьбу ввести год
            cin >> year;        // Считываем число в переменную year
    if (((year % 4) != 0)||(((year % 100) == 0)&&((year % 400) != 0))) // Учитывем условия, не деления на 4, но деления на 100, за исключением 400
    {
        cout << "Год не високосный "; // Выводим результат
    }
        else
        {
         cout << "Год високосный "; // Выводим результат
        }
    return 0;        // Завершаем программу с кодом 0 (успех)
}
