#include <iostream>  // Подключаем библиотеку для ввода/вывода
 using namespace std; // Разрешаем использовать стандартные функции без std::

int main() // Главная функция, с которой начинается выполнение программы
{         
    int N, summ;        // Объявляем переменные
        cout << "Введите N: "; // Выводим просьбу ввести N
            cin >> N;        // Считываем число в переменную N
    for (int i=1;i <= N;i++) // Создаём цикл с итерациями от 1 до N
    {
        summ += i ; // к переменной каждый раз прибавляем число i, чтоб по итогу получить их сумму
    }
     cout << "Сумма: " << summ;// Выводим результат
    return 0;        // Завершаем программу с кодом 0 (успех)
}
