#include <iostream>  // Подключаем библиотеку для ввода/вывода
 using namespace std; // Разрешаем использовать стандартные функции без std::

int main() // Главная функция, с которой начинается выполнение программы
{         
    double NumberOne, NumberTwo, NumberThree;        // Объявляем три переменные для хранения вещественных чисел
        cout << "Введите первое число: "; // Выводим просьбу ввести число
            cin >> NumberOne;        // Считываем первое число в переменную NumberOne
        cout << "Введите второе число: "; // Выводим просьбу ввести второе число
            cin >> NumberTwo;        // Считываем второе число в переменную NumberTwo
        cout << "Введите третье число: "; // Выводим просьбу ввести третье число
            cin >> NumberThree;        // Считываем второе число в переменную NumberThree
    cout << "Среднее арифметическое: " << (NumberOne + NumberTwo + NumberThree) / 3 << endl;      // Складываем,делим числа и выводим


    return 0;        // Завершаем программу с кодом 0 (успех)
}
