#include <iostream>  // Подключаем библиотеку для ввода/вывода
#include <string> // Подключаем библиотеку для рпботы со строками
 using namespace std; // Разрешаем использовать стандартные функции без std::

int main() // Главная функция, с которой начинается выполнение программы
{         
    string Text;        // Объявляем строку
        cout << "Введите строку: "; // Выводим просьбу ввести строку
            cin >> Text;        // Считываем текст в переменную Text
    cout << "длина строки: " << Text.length() << endl;   // Вычиcляем и выводим длину строки
    return 0;        // Завершаем программу с кодом 0 (успех)
}